app/controllers/barrios_controller.rb

  def index
    @barrios = Barrio.all
---
SELECT "barrios".* FROM "barrios"

  def create
    @barrio = Barrio.new(barrio_params)

    respond_to do |format|
      if @barrio.save
---
INSERT INTO "barrios" ("nombre", "habitantes", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["nombre", "porras"], ["habitantes", 23], ["created_at", "2016-02-14 05:40:32.137528"], ["updated_at", "2016-02-14 05:40:32.137528"]]

    def set_barrio
      @barrio = Barrio.find(params[:id])
---
SELECT  "barrios".* FROM "barrios" WHERE "barrios"."id" = ? LIMIT 1  [["id", 1]]